In [1]:
import numpy as np
import pandas as pd

In [2]:
df = pd.read_csv('question.csv')

In [3]:
df.head()

       Product Category  Price  Quantity
0       Widget        A     10       100
1       Gadget        B     20        75
2    Doohickey        A     15        50
3  Thingamabob        C      8       120
4       Widget        B     12        90

In [4]:
df.shape

(12, 4)

In [9]:
df['REVENUE'] = df['Price'] * df['Quantity']
df.head(12)

        Product Category  Price  Quantity  REVENUE
0        Widget        A     10       100     1000
1        Gadget        B     20        75     1500
2     Doohickey        A     15        50      750
3   Thingamabob        C      8       120      960
4        Widget        B     12        90     1080
5        Gadget        C     18        60     1080
6     Doohickey        B     16        40      640
7        Widget        C     14        85     1190
8   Thingamabob        A      9       110      990
9        Gadget        A     11        95     1045
10    Doohickey        C     17        55      935
11  Thingamabob        B     19        70     1330

In [10]:
df1 = df.groupby(['Category']).agg({'REVENUE': sum}).reset_index()
df1

  Category  REVENUE
0        A     3785
1        B     4550
2        C     4165

In [21]:
df1.sort_values(['REVENUE'], ascending = False).head(1)

  Category  REVENUE
1        B     4550

In [31]:
a = '000 pqr 020 400 060 001 1st'
a = a.replace(' ', ',')
a

'000,pqr,020,400,060,001,1st'

In [40]:
b = []
for i in a:
    c = []
    c.append(a)
    if i == ',':
        b.append(c)

In [38]:
print(c)

['000,pqr,020,400,060,001,1st']

In [41]:
print(b)

[['000,pqr,020,400,060,001,1st'], ['000,pqr,020,400,060,001,1st'], ['000,pqr,020,400,060,001,1st'], ['000,pqr,020,400,060,001,1st'], ['000,pqr,020,400,060,001,1st'], ['000,pqr,020,400,060,001,1st']]